Revit 2026 API

# ParameterSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ParameterSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
ParameterSetIterator()
```
```fsharp
new : unit -> ParameterSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

ParameterSetIterator Class

Autodesk.Revit.DB Namespace